#pragma once
//gcc -Werror=return-local-addr
#pragma GCC diagnostic error "-Wreturn-local-addr"
#pragma GCC diagnostic error "-Wreturn-type"
#pragma GCC diagnostic error "-Wmultichar"
#pragma GCC diagnostic error "-Wunused-value"

#pragma GCC diagnostic ignored "-Wsign-compare"
#pragma GCC diagnostic ignored "-Wparentheses"

#include <iostream>
#include <fstream>
#include <sstream>
#include <vector>
#include<iomanip>
using std::vector;
#include <iterator>
#include <regex>
#include <algorithm>
//#define __log(symbol) std::cout << #symbol << " = \n" << (symbol) << std::endl;
//#define __print(symbol) std::cout << #symbol << " = " << (symbol) << std::endl;
//#define __println(symbol) std::cout << #symbol << " = \n" << (symbol) << std::endl;

using qword = unsigned long long;
using BYTE = unsigned char;
using word = unsigned short;
using dword = unsigned int;
static_assert(sizeof(void *) == 8, "only 64-bit code generation is supported!");
static_assert(sizeof(BYTE) == 1, "sizeof(BYTE) must be 1");
static_assert(sizeof(word) == 2, "sizeof(word) must be 2");
static_assert(sizeof(dword) == 4, "sizeof(dword) must be 4");
static_assert(sizeof(qword) == 8, "sizeof(qword) must be 8");

template<typename _Ty, int b = 2>
struct color_ptr {
	static const qword MASK = (1 << b) - 1;
	using _Myt = color_ptr;
	using value_type = _Ty;
	friend std::ostream& operator <<(std::ostream &cout, const _Myt &p) {
		if (!p)
			cout << "nullptr";
		else
			; // cout << *p;
		return cout << ",\t" << std::boolalpha << p.color;
	}

	//postcondition: return a valid pointer
	operator value_type*() {
		return reptr();
	}

	operator const value_type*() const {
		return (const value_type*) reptr();
	}

	color_ptr() {
		value = 0;
	}

	explicit color_ptr(value_type *ptr, BYTE color = 0) {
		this->reptr(ptr);
		this->color = color;
	}

	//_Myt &operator = (value_type *ptr) {
	//	this->ptr = ptr;
	//	return *this;
	//}

	bool operator <(const _Myt &y) const {
		return reptr() < y.reptr();
	}

	bool operator ==(const _Myt &y) const {
		return value == y.value;
	}

	bool operator ==(const value_type *ptr) const {
